app/Models/Modelrab.php

    public function KDrab()
    {
        $lastRecord = $this->orderBy('kd_rab', 'DESC')->first();
---
SELECT *
FROM `tbl_rab`
ORDER BY `kd_rab` DESC
 LIMIT 1

    public function allData()
    {
        return $this->table($this->table)
            ->orderBy('kd_rab', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_rab`
ORDER BY `kd_rab` ASC