app/Models/Modelasesment.php

SELECT *
FROM `tbl_asesment`
ORDER BY `kd_asesment` DESC
 LIMIT 1
---
    public function KDasm()
    {
        $lastRecord = $this->orderBy('kd_asesment', 'DESC')->first();

SELECT *
FROM `tbl_asesment`
ORDER BY `kd_asesment` ASC
---
    public function allData()
    {
        return $this->table($this->table)
            ->orderBy('kd_asesment', 'ASC')
            ->get()
            ->getResultArray();

SELECT `tbl_asesment`.*, `tbl_kat`.`kd_kat`
FROM `tbl_asesment`
LEFT JOIN `tbl_kat` ON `tbl_asesment`.`kd_kat` = `tbl_kat`.`kd_kat`
WHERE `tbl_asesment`.`kd_asesment` IS NULL
 LIMIT 1
---
    public function getAsmByKd($kd_asm)
    {
        return $this->select('tbl_asesment.*, tbl_kat.kd_kat')
            ->join('tbl_kat', 'tbl_asesment.kd_kat = tbl_kat.kd_kat', 'left')
            ->where('tbl_asesment.kd_asesment', $kd_asm)
            ->first();