app/Models/Modelskpb.php

SELECT *
FROM `tbl_skpb`
ORDER BY `kd_skpb` DESC
 LIMIT 1
---
    public function KDskpb()
    {
        $lastRecord = $this->orderBy('kd_skpb', 'DESC')->first();

SELECT *
FROM `tbl_skpb`
ORDER BY `kd_skpb` ASC
---
    public function Alldata($kd_skpb = null)
    {
        if ($kd_skpb) {
            return $this->db->table($this->table)
                ->where('kd_skpb', $kd_skpb)
                ->get()
                ->getRowArray();
        } else {
            return $this->db->table($this->table)
                ->orderBy('kd_skpb', 'ASC')
                ->get()
                ->getResultArray();

SELECT `tbl_skpb`.*, `tbl_periode`.`tahun_periode`
FROM `tbl_skpb`
LEFT JOIN `tbl_periode` ON `tbl_skpb`.`kd_periode` = `tbl_periode`.`kd_periode`
WHERE `tbl_skpb`.`kd_skpb` = 'SKPB0001'
 LIMIT 1
---
    public function getSkpbByKd($kd_skpb)
    {
        return $this->select('tbl_skpb.*, tbl_periode.tahun_periode')
            ->join('tbl_periode', 'tbl_skpb.kd_periode = tbl_periode.kd_periode', 'left')
            ->where('tbl_skpb.kd_skpb', $kd_skpb)
            ->first();