app/Models/Modelperiode.php

SELECT *
FROM `tbl_periode`
ORDER BY `kd_periode` ASC
---
    public function Alldata()
    {
        return $this->db->table($this->table)
            ->orderBy('kd_periode', 'ASC')
            ->get()
            ->getResultArray();