app/Models/Modelkategori.php

    public function getAll()
    {
        return $this->db->table($this->table)
            ->orderBy('kd_kat', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_kat`
ORDER BY `kd_kat` ASC